{
  "cheesy": [
    "Are you a magician? Because whenever I look at you, everyone else disappears.",
    "Do you have a map? Because I just got lost in your eyes.",
    "Is your name Google? Because you have everything I've been searching for.",
    "Are you made of copper and tellurium? Because you're Cu-Te.",
    "Are you a bank loan? Because you have my interest!"
  ],
  "cute": [
    "Do you have a name, or can I call you mine?",
    "Do you believe in love at first sight, or should I walk by again?",
    "Are you a time traveler? Because I can see you in my future.",
    "Do you have a sunburn, or are you always this hot?",
    "If you were a vegetable, you'd be a cute-cumber!"
  ],
  "funny": [
    "Are you a campfire? Because you're hot and I want s'more.",
    "Are you a beaver? Because daaaaaam!",
    "Are you Australian? Because when I look at you, I feel like I'm down under.",
    "Is your name Wi-Fi? Because I'm really feeling a connection.",
    "If you were a vegetable, you'd be a cutecumber!"
  ],
  "flirty": [
    "If you were a vegetable, you'd be a cute-cumber!",
    "Do you believe in love at first sight, or should I walk by again?",
    "If beauty were a crime, you'd be serving a life sentence.",
    "Do you have a name, or can I call you mine?",
    "I must be a snowflake because I've fallen for you."
  ],
  "unique": [
    "Are you a bank loan? Because you have my interest!",
    "If you were words on a page, you'd be the fine print.",
    "Are you made of copper and tellurium? Because you're Cu-Te.",
    "If you were a fruit, you'd be a fineapple.",
    "If looks could kill, you'd be a weapon of mass destruction."
  ],
  "romantic": [
    "If kisses were snowflakes, I'd send you a blizzard.",
    "Do you have a map? Because I just got lost in your eyes.",
    "Are you a camera? Because every time I look at you, I smile.",
    "I must be a snowflake because I've fallen for you.",
    "Are you a campfire? Because you're hot and I want s'more."
  ],
  "nerdy": [
    "Are you made of copper and tellurium? Because you're Cu-Te.",
    "If you were words on a page, you'd be the fine print.",
    "Do you like Star Wars? Because Yoda one for me!",
    "Are you a 90-degree angle? Because you're looking right!",
    "Are you a carbon sample? Because I want to date you!"
  ],
  "smooth": [
    "If beauty were a crime, you'd be serving a life sentence.",
    "Can I borrow a quarter? I want to call my mom and tell her I just met the girl of my dreams.",
    "Excuse me, but I think you dropped something: my jaw.",
    "Do you have a name, or can I call you mine?",
    "Is it hot in here, or is it just you?"
  ],
  "creative": [
    "Are you a dictionary? Because you add meaning to my life.",
    "If you were a vegetable, you'd be a cutecumber!",
    "Do you have a Band-Aid? Because I just scraped my knee falling for you.",
    "Is your name Google? Because you have everything I've been searching for.",
    "Do you have a sunburn, or are you always this hot?"
  ],
  "situational": [
    "Do you believe in love at first sight, or should I walk by again?",
    "Can I follow you home? Cause my parents always told me to follow my dreams.",
    "Are you Australian? Because when I look at you, I feel like I'm down under.",
    "Is there an airport nearby or is it my heart taking off?",
    "Can I have directions? [To where?] To your heart."
  ]
}
